["The name of the entity or project being discussed is derived from numbers that make words.", "The project is described as an interesting experiment and a variation of a bug-bounty, where it is time-limited and there is a guaranteed pot that pays out.", "There is interest in involving other security researchers in the project.", "There is a suggestion to create a page for the contest and list or link to wardens, judges, and sponsors.", "There is a suggestion to have a form for people to fill out when joining as a warden, including links to their socials, bio, avi, etc.", "There is a channel that can be added for ideas, and people are encouraged to submit PRs with any ideas to the GitHub.", "There is a document with notes about proposed website enhancements and additions.", "Access to the codebase will be available on February 17 @ 1400 UTC (9AM EST).", "The smart contracts being discussed are from the \"real world\" and will be used in practice, not just made for the purpose of the competition.", "These smart contracts will be deployed after being audited.", "There is an expectation that the team should not hide issues in the smart contracts on purpose.", "There are guidelines on how to report issues related to these smart contracts at https://github.com/code-423n4/code-contests/blob/main/SUBMISSION_POLICY.md", "There is a medium article on a competition for slingshot finance at https://medium.com/@scott_lew_is/slingshot-finance-sponsors-20-000-usdc-guaranteed-distribution-bounty-pool-for-code-432n4s-first-789514a8dc99", "There was an issue with delivering a message to submissions@code432n4.com because the domain code432n4.com couldn't be found.", "There was an issue with the domain code432n4.com not being found when trying to send a message to submissions@code432n4.com.", "Reports for the contest should be submitted at the end of the contest period.", "If two participants submit the same bug at the end of the contest, the judging criteria for duplicate submissions can be found at https://github.com/code-423n4/code-contests/blob/main/JUDGING_CRITERIA.md#duplicate-submissions", "There are resources available for learning about Solidity at https://solidity-by-example.org/0.6 and https://docs.soliditylang.org/en/v0.7.5/", "The #⚽team-formation channel is recommended for joining a team.", "Judges for the contest are chosen based on experience and reputation.", "The results of the contest will be published after the contest concludes.", "The judging criteria for the contest can be found at https://github.com/code-423n4/code-contests/blob/main/JUDGING_CRITERIA.md", "Information on how to run the slingshot code as it executes in the overall system can be found at https://github.com/code-423n4/code-contests/tree/main/contests/01-slingshot#how-it-works", "The contracts can be compiled and function independently of the back end.", "A Loom video will be made to show how to set up the environment.", "There was a request for a countdown timer to ensure the submission deadline is not missed.", "A Loom video is planned to be created to show how to set up the environment.", "There is a request for a countdown timer to track the submission deadline.", "There is a suggestion to add links and preferred avatars from competing wardens to the home page along with the countdown.", "The stop time for the contest is February 21, 2359 UTC.", "There is a suggestion to create a leaderboard of the best contestants after the results of the contest.", "The leaderboard could be manually updated until a system is built to track it.", "There is a question about whether all participants reviewing are in the warden section.", "Submissions will be made available after the contest ends once possible exploits have been patched.", "The focus of the contest is on smart contracts, but suggestions are open if something else relevant is found.", "The Submission Policy states that submissions can't be made more than 3 hours prior to the contest stop time.", "There is a 3-hour window in which findings can be submitted.", "A suggestion was made to allow submissions any time prior to the contest end time, with a policy of accepting only the first or last entry from each person or team.", "If participants have code that runs proof of concept for each bug, they can submit it by adding a zip file to the submission or sharing a private GitHub repo.", "The documents will be updated to reflect the suggestion of allowing submissions any time prior to the contest end time.", "Each proof of concept is about 50 lines long and is part of a whole hardhat project so that they can be run.", "There is a discussion about how to submit proof of concept (POC) code for each bug found in the smart contracts.", "The POC code can be submitted as a zip file or through a private GitHub repository.", "The POC code is part of a hardhat project and each POC is about 50 lines of code.", "There is a suggestion to add GitHub usernames to the submissions.", "There is a link provided for sharing vulnerability/discovery POC at https://github.com/code-423n4/code-contests/tree/main/contests/01-slingshot#sharing-vulnerabilitydiscovery-poc", "There is a discussion about whether to consider the potential impact of misbehavior of the owner of the smart contracts.", "The project should add a proper trust model description for involved roles to answer these kind of questions.", "There is a consideration of social engineering attacks on the owner of the smart contracts.", "Some participants considered a malicious or compromised owner out-of-scope for this game.", "There is a question about the correct email for sending submissions, which is clarified as submissionS@code423n4.com.", "There is a question about the trust model for ElasticDAO, specifically about the controller and the summoners.", "The controller/minter/burner can be trusted as it is a multisig that enacts the snapshot votes on chain.", "There is a discussion about how to contribute to the project, with suggestions to become an auditor or to participate in a code contest as a warden.", "There is a link provided to old audit reports at https://chainsecurity.com/audits/ for those interested in becoming auditors.", "There is a question about the lead time if someone were looking to sponsor a contest.", "The project is mostly targeted at auditors.", "One way to contribute to the project is by becoming an auditor.", "Learning about the project can be done through reverse engineering, reading old audit reports, and understanding each issue raised.", "Audit reports are available at https://chainsecurity.com/audits/.", "There are opportunities to contribute to the project as a warden in code contests.", "The lead time for sponsoring a contest is not long, but specific timeframes are not provided.", "The source code for Maple Finance is discussed, but no specific link or location is provided.", "The maple-core repo has a test script set to use 100 fuzz runs, but for first time users, it is recommended to use 1 fuzz run and then increase to 10-100 fuzz runs after the first run.", "The results of previous competitions will eventually be made public and each contest will have a report generated for it.", "The only public report at the time of the chat is the ElasticDAO report, which can be found at https://ipfs.io/ipfs/QmU7JQUCuciGJ9EVApWnPvBCy32eYQnREDFGsxoyDR6w3j.", "Results and public findings are posted in the #announcements channel.", "To become a warden, one must register by joining the #🐺i-want-to-be-a-warden channel and stating their interest.", "Teams can be registered by creating a team handle and adding it to the project's GitHub page at https://github.com/code-423n4/code423n4.com/blob/main/data/handles/pocotiempo.json.", "Teams should use their team handle when submitting issues and can add other members' handles as well.", "Team members can be added by dropping a PR and using the team handle when submitting issues.", "For the maple-core repository, there are issues with updating submodules via public git due to 'Permission denied (publickey)'.", "Maple submissions are supposed to be made through https://c4-maple.netlify.app/ and not via email.", "Handles can be added to the code423n4.com repository, and any handle can be used, including a GitHub or Gab handle.", "The handle is used for the leaderboard on code423n4.com and for handling award processing.", "A team request was submitted via a pull request on https://github.com/code-423n4/code423n4.com/pull/28.", "The repository for the Vader protocol is https://github.com/code-423n4/2021-04-vader/tree/main/vader-protocol.", "A mathematical formula for syntheticAssets was added to the Vader protocol repository at https://github.com/code-423n4/2021-04-vader/commit/3041f20c920821b89d01f652867d5207d18c8703.", "There are a number of wardens competing for the Vader protocol bounty.", "Results for past projects are being worked on and should be up soon.", "Marginswap awards and results are expected to be announced the next day.", "Maple is just starting with sponsor review and then will move on to judging.", "Questions about the Vader protocol can be directed to a specific individual, and the latest updates have been posted at https://github.com/code-423n4/2021-04-vader.", "Marginswap awards and results are expected to be announced the day after the chat.", "Maple is starting with sponsor review, then proceeding to judging.", "For Vader, questions around the protocol can be directed to the main developer.", "Updates for Vader, including mathematical formulas of synths, have been posted at https://github.com/code-423n4/2021-04-vader", "An incorrect copy of Vether.sol was put into the Vader-Review repo, the correct code deployed on Mainnet is available at https://etherscan.io/address/0x4Ba6dDd7b89ed838FEd25d208D4f644106E34279#code", "The incorrect testing contract that was uploaded can be found at https://github.com/code-423n4/2021-04-vader/blob/main/vader-protocol/contracts/Vether.sol", "The main Vader developer is considered legitimate by the organization.", "All contracts for testing are in https://github.com/code-423n4/2021-04-vader/tree/main/vader-protocol/contracts", "There is missing functionality in the Vader protocol that is yet-to-be/being added, as indicated at https://github.com/code-423n4/2021-04-vader#known-deviations-from-spec", "The fairness of the contests is essential so the judging process will keep this in mind.", "The default will be based on the provided contest code, and the assumption that wardens have not received further updates beyond what was available at contest start in the repo.", "If there are additional findings in the mainnet contract, those can qualify as well.", "The missing logic, which is outlined in the README, is outside the scope of the review.", "VETH is a fair launch distribution mechanism for VADER, a liquidity protocol that combines slip based fees of rune, IL protection of Bancor, burn to mint stablecoin of Luna, pool collateralized synthetics with 1:1 purchasing power that are interest yielding like anchor, and synths can also be used to borrow directly from the AMM for capital efficiency.", "Vether attempts to drive value accrual from Vader to Ether via a daily auction process that requires participants to burn their ETH to obtain VETH.", "More information about VADER can be found at https://linktr.ee/VaderProtocol", "The handles for the leaderboard will be updated once several of the process pieces have been reworked.", "A PR was definitely merged from https://github.com/heiho1/code423n4.com/pulls", "For Visor finance, there was a question about which contracts should be reviewed.", "There is a process for updating handles for individuals and teams, but it is currently delayed due to a backlog.", "The handles are used for the leaderboard.", "A pull request was merged from https://github.com/heiho1/code423n4.com/pulls", "For Visor finance, only the Visor.sol contract should be reviewed.", "Questions related to FairSide can be directed to a specific individual via direct message.", "Gas optimizations and better defining the formula are eligible for the contest and would be appreciated.", "There is no dedicated pot for gas optimizations.", "Formula optimizations will be considered for a medium to high \"share\" allocation.", "A whitepaper was pushed to the C4 GitHub repository under /docs.", "A video was recorded walking through the main contracts in the Vault: https://youtu.be/D-hSiGeNpuY", "A sample of a script to deploy and set up Yield v2 was shared.", "Questions can be asked in private for detailed answers and guidance.", "An explanation of how users interact with Yield v2 was provided.", "The contest had approximately 36 hours remaining at the time of the chat.", "Users are encouraged to ask questions privately for detailed answers and guidance.", "The interaction with Yield v2 is explained in the chat instead of a video.", "There is a time limit of approximately 36 hours for a certain task.", "The severity of issues is to be considered based on guidelines outlined at https://code423n4.com/judging-criteria/", "The complexity of calculating the severity for each issue is acknowledged.", "There is a concern about the lack of exploration of exploits involving a batch with several actions.", "Handle registration is mandatory for submitting something.", "There is a grace period on submissions.", "The self-assessment of risk is considered important and can make a difference.", "The severity of an issue is ultimately determined by a judge.", "There is a significant difference between award levels for severity.", "A user is added as a warden.", "There is a request to check https://github.com/code-423n4/code423n4.com/pull/62", "Week-long contests are run each week.", "Upcoming audit contests are listed on the website: code423n4.com", "Reality Cards is starting in about ~11 hours and Pool Together will start next week.", "There is a suggestion to draft a post for announcements to make it easier for newcomers to know where to find key information to start participating.", "The co-founder of Reality Cards and their solidity engineer are present in the chat.", "The Reality Cards bug bounty is starting in 6 hours.", "There is an outreach effort to connect with users and ask them about their experiences with C4.", "Upcoming audit contests are listed on the CodeArena website at code423n4.com.", "Reality Cards and Pool Together are two upcoming audit contests.", "There is a suggestion to create a post in the announcements or start-here channel to make it easier for newcomers to find key information.", "Reality Cards is starting a bug bounty.", "Users can ask questions about the RealityCards code.", "PoolTogether is available for questions and direct messages.", "Lion's Mane is working with the Tracer DAO on a Tracer bug bounty.", "There is a contest preview channel.", "Users need to register as a warden to see the contest preview channel.", "Gro protocol is running a competition and is available for questions.", "Wild Credit has a protocol developer available for questions.", "Connext is running a flash context and has a video walkthrough available at https://youtu.be/ABEOIKzEshA.", "InvariantTransactionData.transactionId is a unique identifier for the crosschain transfer to be used in Connext's protocol.", "Spartan Protocol contest has started and users can ask questions.", "Sherlock contest has started and users can ask questions.", "Sherlock V1 has been designed this year and is participating in the arena.", "Sherlock protocol is technically unaudited as the results of the Quantstamp audit have not been received yet.", "A unique identifier is used for the crosschain transfer in the context of the router and subgraph.", "There is a Spartan Protocol contest ongoing and participants are encouraged to ask questions either privately or in open discussion.", "The Sherlock contest is also ongoing, and participants can ask questions privately to the host.", "Sherlock V1 has been designed this year and is participating in the arena.", "An advisor to the Sherlock protocol will not be participating in the contest.", "The Sherlock protocol is technically unaudited as the results of the Quantstamp audit have not been received yet.", "There is a micro-audit for PoolTogether starting soon and participants can ask questions to the point of contact.", "The PoolTogether code for the audit can be found at https://github.com/code-423n4/2021-07-pooltogether.", "The two contracts in scope for the PoolTogether audit are linked in the README.", "There was confusion around tests and peripheral code such as interfaces in the last audit.", "There is a question about what happens if multiple people report the same vulnerability.", "Some wardens act as teams in the contests, as seen on the leaderboard at https://code423n4.com/leaderboard/.", "Forming a team can increase chances of winning and prevent splitting awards at a decaying level.", "There is a question about the difference between low/medium/high risk finds.", "The final determination of severity is made by an independent judge with deep solidity knowledge, as explained at https://docs.code4rena.com/roles/wardens/judging-criteria#estimating-risk-tl-dr.", "Beginner solidity developers are encouraged to participate in the competition to sharpen their skills.", "The float capital $50k audit contest is starting soon and the code for it is at https://github.com/code-423n4/2021-08-floatcapital.", "Beginners looking to start smart contract bug bounty hunting are recommended to start with https://cryptozombies.io/ and https://capturetheether.com/.", "OpenZeppelin webinars on governance mechanisms and best practice are recommended for security auditors, with the first video in the series at https://youtu.be/6GaCt_lM_ak.", "A beginner in blockchain bug bounty hunting is advised to start with https://cryptozombies.io/ to get a feel for solidity.", "Capture the Ether (https://capturetheether.com/) is suggested as a useful resource for beginners in blockchain bug bounty hunting.", "There is a Github repository for the project at https://github.com/code-423n4/2021-08-floatcapital.", "More videos are planned to be added to a walkthrough playlist, particularly walking through the Staker.sol and some of the incentive curves in the system.", "The OpenZeppelin webinar on governance mechanisms and best practice is recommended for security auditors, with a link to the first video in the series https://youtu.be/6GaCt_lM_ak.", "A new video has been added to a YouTube playlist, walking through some subtleties in the SyntheticToken contract https://www.youtube.com/playlist?list=PL7RT-0ybd7joiqKeGklvFxcc8dNWpPBCk.", "FloatCapital_v0.sol, Treasury_v0.sol, and orcales/ are not in the scope for bounties.", "The term \"target side\" and \"origin side\" relate to shifting between long and short positions within a market.", "Learning Solidity is recommended for understanding the code base and how the system works.", "Another video is planned to give more details on the Staker.sol contract.", "A new video about Staker.sol has been added to the playlist https://www.youtube.com/playlist?list=PL7RT-0ybd7joiqKeGklvFxcc8dNWpPBCk.", "The nature of the competitions is that the findings are kept under wraps until the contest is over and the judging process has been completed. Duplicate submissions are not a problem.", "The incentive structure and judging criteria for the competitions are explained at https://docs.code4rena.com/.", "Two big bugs have been found in the internal audit that have not been picked up by any wardens yet.", "There is a Discord community for the project at https://discord.gg/5WHvfHeSwr.", "The team is aiming for a quick turnaround time in going through the submitted issues.", "There was an ongoing audit contest with a prize of $50k.", "Two significant bugs were yet to be found in the audit contest.", "The contest had a time limit, with reminders given when there was 16 hours and 1 hour 18 minutes remaining.", "The contest was a learning process for beginners.", "Once the findings repo becomes public, it can be used to learn from other wardens' findings.", "The Discord server has been updated to have each contest have its own channel for questions, code walkthroughs, etc.", "CodeArena is not exactly a bug bounty platform like HackerOne. A comparison between bug bounties and C4 audit contests can be found at https://docs.code4rena.com/.", "There was a question about the payout for the gravity bridge competition, with the response indicating it would happen within two weeks.", "There was a question about making a submission on a program, with the response indicating that the user's handle had been added.", "There was a question about contacting Wild Credit regarding their provided code, with the response directing the user to a specific channel or to direct message a specific user.", "There was a question about the visibility of a channel, with the response indicating that the issue had been resolved.", "There was a question about the completion of individual warden registrations, with the response indicating that they were complete and the user should be able to access the repo.", "There was a discussion about the challenges of setting up the environment for auditing contracts, especially when there is limited documentation, no test cases, and no deployment scripts.", "One suggestion was to write a test for the code in the existing test environment, rather than trying to deploy all contracts.", "If there is no test setup in the C4 repo, one suggestion was to check if there is a repo on the sponsor's GitHub that has a test setup, or to pull out the code or rewrite parts of the contract to easily test the snippet.", "Some contest repositories have limited documentation, no test cases, and no deployment scripts, which can make setting up the environment time-consuming.", "Some users write tests in the existing test environment of the repository to confirm code functionality.", "If there is no test setup in the repository, some users check if there is a repository on the sponsor's GitHub that may have a test setup.", "If no test setup is available, some users pull out the code or rewrite parts of the contract to test the snippet they want to test.", "Eth-brownie is mentioned as a helpful tool for mocking contract deployments and setting up fixtures for certain contract deployments.", "The Yaxis audit report will take longer than usual to be posted on the website due to a high participation rate and a large number of submissions to review.", "Rinkeby testnet tokens can be obtained from https://faucet.rinkeby.io.", "The process to withdraw a contest report is described in the documentation, but users can also direct message the staff for assistance.", "Bug finding submissions can be viewed at https://code423n4.com/reports and https://github.com/code-423n4.", "After submitting a finding, users do not need to do anything else but wait until the contest ends and check the results on the website.", "The contest awarding usually takes a couple of weeks to be finalized after the contest closes.", "There are ongoing conversations about many more competitions.", "Users can alter the severity of their reported bugs after the closing time of the contest by contacting the staff.", "Participants can alter the severity of their reported bugs after the closing time of the contest through direct messages or by contacting the judges.", "There is a vault that is reported to be bugged, with the link to it being https://etherscan.io/address/0x9705e8807aae04c7dc0967da9cab8af65d2f2135.", "The report for the Yaxis audit is being worked on, with the sponsors having the final say on the publication timing to give them sufficient time to mitigate issues.", "The average turnaround time from audit competition to release of reports is about a month, with efforts being made to decrease this time.", "Team members can be added to the boot finance rooms to monitor progress.", "The Overlay Protocol contest was delayed by 5 days, with the start date changed to 11/16 at midnight UTC.", "If the same vulnerability is found in multiple different components of the codebase, it may count as two separate findings rather than a duplicate, but this is ultimately up to the judge's discretion.", "Awards are distributed based on individual issues, with multiple items in one submission counting for one submission.", "Markdown is suggested for formatting code in contest findings, with a code block in markdown being surrounded by ``` on either side.", "Non-critical findings do not have a share in the award pot.", "There is currently no incentive for QA type of submissions, as sponsors are interested in high/medium/low severity vulnerabilities and gas optimizations. There has been discussion of possibly having a small QA pot if sponsors want this sort of submission, but there is no mechanism for it at this time.", "There is no share for non-critical findings in the auditing process.", "Currently, there isn't an incentive for QA type of submissions, sponsors are interested in high/med/low severity vulnerabilities and gas optimizations.", "There is a suggestion to add the severity of the bug to the C4 emails that are sent out after an issue is submitted.", "There is a suggestion to add position numbers to the leaderboard.", "There is a suggestion to add a Low column to the leaderboard.", "There are plans for the leaderboard, which are currently in the idea phase.", "There is a suggestion to put roles in discord that reflect the leaderboard.", "There is a suggestion to sort the projects by date directly and to move the actual project into a project directory, keeping the README in the top-level one.", "There is an idea to apply different timelines to the leaderboard, in addition to \"all time\", such as a \"last 3 months\" view.", "There is a suggestion to collect badges for various achievements, which could potentially be tokenized as NFTs.", "There is a suggestion to have seasons for the leaderboard, each season lasting a year, and at the end of the season everyone on the leaderboard gets an NFT for that season which includes metadata of the rank and money made.", "There is a suggestion to end the season when somebody hits a certain $ target, making each season a race.", "There is a reference to a behavior of Brownie, a Python framework for Ethereum smart contract testing, deployment, and interaction. The behavior is that the project name must start with an alphabetical character, which can cause issues with the default naming convention of C4. The link to the relevant code in the Brownie project is https://github.com/eth-brownie/brownie/blob/0fa4477a178bd55b6683f60d077b7060df02b2c5/brownie/project/main.py#L740.", "There is a suggestion for a season to last 4 or 6 months to allow people to work consistently and then take a break.", "The idea of ending a season when someone hits a certain $ target was proposed.", "There is a suggestion to use the average percentage of pool awarded as a metric, as not everyone participates in every contest due to various reasons such as lack of time or preference.", "The awarding process for bug bounty is considered difficult to understand by some participants.", "The risk estimation for the contest is categorized into four levels: Non-critical, Low, Med, and High, each with specific criteria.", "Information about the incentive model and awards can be found at https://docs.code4rena.com/#incentive-model-and-awards", "There is a suggestion box channel for sharing ideas for improving the website, leaderboard systems, contest processes, and Discord setup.", "The streaming protocol contest was postponed and will be starting on 11/30.", "To update a submission, one can direct message the organizers.", "The awards for the Fairside contest are expected to be announced the following week.", "The audit reports for the competitions are published after the contest finishes, sponsor reviews issues, judging, awarding, and reporting. The speed of this process varies widely, but efforts are being made to speed up these steps.", "Fairside awards are being worked on and are expected to be announced the following week.", "The process for the competition involves contest finish, sponsor reviews issues, judging, awarding, and reporting.", "The C4 team usually gets awards and reports out in less than a week after sponsor review and judging are done.", "The speed of sponsor review and judging can vary widely, from as fast as a 2 week turnaround to 6+ weeks in some cases.", "The C4 team is constantly working on improving their tools and tightening processes to speed up these steps.", "There is a process for submitting issues, and it's possible to submit the same issue twice for clarification.", "There is a registration process to become a Warden at https://docs.code4rena.com/roles/wardens", "The C4 team was out for Thanksgiving and would be back the following Monday.", "There was an issue with email receipts for contest findings not being received.", "The issue with email receipts might be related to a problem with Github at https://www.githubstatus.com/incidents/r5qrpp2f5fc0", "The contest findings can be found at https://code4rena.com/reports", "There was an issue with a user's email flagging C4 emails as spam.", "The term \"gov-wg\" refers to a Working Group set up for a DAO structure.", "Some users have experienced issues with receiving emails from CodeArena, with emails being flagged as spam.", "Users are advised to switch to a different email address if they are experiencing issues with receiving emails.", "\"gov-wg\" refers to a Working Group set up to establish a DAO structure.", "There was a dispute regarding a submission on CodeArena, which was marked as disputed due to the issue being described in the documentation. The link to the disputed submission is https://github.com/code-423n4/2021-10-slingshot-findings/issues/21 and the accepted submission is https://github.com/code-423n4/2021-10-slingshot-findings/issues/82.", "In the contest at https://code4rena.com/contests/2021-11-streaming-protocol-contest, the contracts mentioned are StreamFactory, Stream, and LockeERC20. However, in the repository at https://github.com/code-423n4/2021-11-streaming/tree/main/Streaming/src, only Locke and LockeERC20 appear.", "All the mentioned contracts are inside locke.sol.", "Users can add screenshots to the report of vulnerability by using Markdown and embedding a remotely-hosted image.", "Gas optimizations are awarded from a separate award pool that is specified on the CodeArena website and in the contest repo. The link to the award calculation is https://docs.code4rena.com/#incentive-model-and-awards.", "There is no additional weighting among gas optimizations. All valid findings are weighted the same.", "Users can contact the protocol team for clarification by reaching out in the contest channel.", "There was a schedule for Christmas that included some downtime. The link to the schedule is https://discord.com/channels/810916927919620096/810929015509483554/908791439771725854.", "There is a way to contact the streams' protocol team for clarification.", "The best option to reach out is in the contest channel.", "There is a need for the warden role to see the contest channels, which can be obtained by filling a form on the website.", "In case of a source code leak, anyone could fork a project and deploy the same code, but users are unlikely to interact with it unless the team endorses it.", "The tool that generates a specific output is not known, but most people use Slither.", "There is an incentive for wardens to submit non-critical vulnerabilities as it benefits the sponsor, even though they are not taken into consideration when calculating awards. The link to an example of a non-critical vulnerability is https://github.com/code-423n4/2021-10-tracer-findings/issues/5", "If two critical vulnerabilities can be combined to create a third, much more powerful one, it may be worth dropping a third finding explaining the proof of concept.", "Once a finding is submitted for a contest, the only confirmation received is the mail copy of the form.", "The warden resources seem to be geared towards solidity tutorials, and a user is looking for Cosmos related learning resources.", "The funds will be sent to a specific address regardless of wallet settings, and to move the funds, a transaction on polygon needs to be sent.", "Metamask should be able to show the tokens in an address when swapping networks to Polygon. If not, the tokens can be manually added in. The address can be monitored at https://polygonscan.com/address/<your address>", "To move the funds back to the mainnet, the polygon bridge can be used at https://wallet.polygon.technology/. Alternatively, funds can be deposited directly into a CEX that supports native polygon deposits.", "In a findings report, adding a link that points to the sponsor's github repo code does not automatically pull in that code snippet to the report.", "There was a prize of USDC announced on 6th December related to badgerdao ibBTC.", "The payment of the prize will be made on the Polygon network.", "Metamask can show tokens in an address when networks are swapped to Polygon.", "Tokens can be manually added in Metamask if they do not appear automatically.", "An address can be monitored on Polygon at https://polygonscan.com/address/<your address>.", "Funds can be moved back to the mainnet using the polygon bridge at https://wallet.polygon.technology/.", "A findings report does not automatically pull in a code snippet from a link pointing to a sponsor's GitHub repo code.", "The actual code needs to be added to the findings report along with the link.", "There is a form on the website to submit findings.", "There is a process to verify wardens.", "The funds for the 2nd place winner of the nested finance audit contest were not yet sent out at the time of the chat.", "There is a way to edit a finding after it has been submitted.", "The organizer team can help update an issue.", "The funds for the contest will be sent on Monday or Tuesday.", "Awards from the recent fairside contest have not been distributed yet.", "Awards are distributed on the Polygon network.", "The process of becoming a warden was discussed.", "The reward distribution process takes longer than expected due to an increase in wardens and contests.", "Reducing turnaround times for reward distribution is a high priority.", "There is a way to register as a warden.", "The project team for a specific project can be found in a specific channel.", "The project team members can be directly messaged for consultation.", "The project team members can be found and consulted in a specific channel on the Discord.", "Users need to register as a warden to access certain channels.", "There was an issue with the submission form that was causing a purple screen to appear, which was later fixed.", "The submission forms should work unless a user is using a smart contract wallet like gnosis or argent.", "Findings from the contest are confirmed and discussed after the contest ends.", "The issues of a project named \"fei\" are not public yet, but will be compiled into a report and shared later.", "Zero address checks are considered a valid finding as they can lead to loss of funds if tokens are transferred to a zero address.", "There was a discussion about what is considered to be a privilege escalation.", "Some contracts are like a \"snapshot\" of OpenZeppelin (OZ) contracts, and this is usually done to allow the project to make necessary changes to these external contracts to suit their project requirements better.", "There was a question about whether there is a tool that allows auditors to see \"diffs\" in contracts.", "A link to a GitHub issue was shared: https://github.com/code-423n4/2021-10-badgerdao-findings/issues/5", "There is a suggestion to start a list of common issues that should be flagged as non-critical or informational.", "Some contracts are like a \"snapshot\" of OpenZeppelin (OZ) contracts, which is a common practice to allow the project to make necessary changes to these external contracts to suit their project requirements better.", "Auditors may need to manually check the differences between contracts, or they might be able to run a diff command on the two contracts.", "It's common to copy/paste OpenZeppelin source code into the repo without using the npm library.", "OpenZeppelin provides a wizard for contract creation at https://docs.openzeppelin.com/contracts/4.x/wizard", "Each issue in the auditing process is evaluated strictly on what was submitted, and judges do not have the capability to \"multiply\" an issue.", "Hardhat is a tool used for running tests on a forked network.", "Submissions for audits should be done using the \"Submit finding\" button of the specific contest on the main page, each finding should be submitted separately.", "The old submission template at https://github.com/code-423n4/code-contests/blob/4db2720312f0958f2e89f6207a6774c9e5360655/SUBMISSION_TEMPLATE.md is outdated and not in use anymore.", "Gas optimizations should be submitted as separate issues for different optimizations.", "If two people are a team and use the same warden, and they find the same issue and they both submit it with different wallets, it is not clear what happens in this scenario.", "There was a broken link that was reported and fixed through a pull request.", "Gas optimizations should be reported as separate issues for different optimizations.", "If two people find the same issue and submit it with different wallets, each will get less than half of the reward. More information can be found at https://docs.code4rena.com/#incentive-model-and-awards.", "There was a delay in the distribution of awards for a certain event, but they were eventually received.", "Nested Finance awards were distributed.", "There is an interest in creating a contest for auditing code for an AMM project on the Algorand Blockchain.", "Users should receive an email of their submission, whether it is valid or not.", "The contest process includes completion, Sponsor Review, Judging, Awarding, and Reporting stages.", "The results of submissions will be visible in the final published report and the findings repo will also be made public.", "There is no email notification for the validity of each submitted issue.", "There is a suggestion for an email summary of an individual warden’s performance as a future feature.", "The Livepeer contest page is at https://code4rena.com/contests/2022-01-livepeer-contest.", "There is a query about creating a proposal.", "There is a query about the address of the C4 token.", "There is a Livepeer contest on CodeArena, which can be found at https://code4rena.com/contests/2022-01-livepeer-contest.", "Users can create a proposal, but they need to have (or be delegated) 50k tokens to make an on-chain proposal.", "The address of the C4 token is 0x6847D3A4c80a82e1fb26f1fC6F09F3Ad5BEB5222.", "Users can attach their Twitter handle and profile picture to their CodeArena profile by making a pull request at https://github.com/code-423n4/code423n4.com/tree/main/_data/handles.", "Users are currently advised not to change their handles due to the amount of data keyed off that.", "To verify changes to handles, users can create a signed message at mycrypto.com and add the json to the PR using a wallet address they have used in a contest.", "The link to create a signed message is https://app.mycrypto.com/sign-message.", "There is a discussion about the best platform to buy Matic, with a link provided for further information: https://discord.com/channels/810916927919620096/824698635815223316/915880736664461322.", "There is a query about receiving an award from Mellow Protocol, with the response indicating that the rewards have not been sent yet.", "There is a question about counting the number of lines of code in a Solidity contract, with two tools mentioned: Solidity Coverage (https://www.npmjs.com/package/solidity-coverage) and Solidity Metrics nSLOC (https://github.com/ConsenSys/solidity-metrics).", "The PAST CONTEST STATUS UPDATES are listed as a timeline, showing where contests are currently in the process.", "The order in the PAST CONTEST STATUS UPDATES section represents the order of the contest progression.", "There is a question about updating/confirming a reward wallet address.", "The goal is to pay awards in the same week they are announced.", "The team is working on processing several rewards by the end of the week, including MapleOverlaydefiprotocol 1defiprotocol 2yAxis mini 1MellowBootUnlockStreamingProtocolPerennial.", "The PAST CONTEST STATUS UPDATES section shows where contests are currently in the process.", "The order in the PAST CONTEST STATUS UPDATES section represents the order of the contest progression.", "Users can update or confirm their reward wallet address.", "Awards are generally paid in the same week they are announced.", "The team is working to process a number of awards by the end of the week, including MapleOverlaydefiprotocol 1, defiprotocol 2, yAxis mini 1, MellowBoot, UnlockStreamingProtocol, and Perennial.", "Users can participate in the contests once their status is approved.", "It is possible to direct message someone from the code4arena.", "It is possible to change the wallet address to which users receive tokens, but it requires significant effort on the part of the team to manage this.", "The team collects the wallet addresses separately for each contest and does not store them centrally.", "If a user requests an address change, the team needs to collect a list of every contest they used that wallet form, and then manually update the wallet address for each one.", "The team is working on a better process for changing wallet addresses in the future.", "Teams generally get a few contracts reviewed or entire protocols.", "Rewards for Yeti Finance are likely to be distributed the following week.", "Users are recommended to ensure they receive email confirmation of each submission.", "The email confirmation does not contain the Ethereum address provided by the user.", "Judges and sponsors appreciate when similar issues are grouped together in submissions.", "There was a spam issue with Yahoo and Hotmail email addresses in the past.", "There was a concern raised about a potential scam.", "A user reported not receiving an email regarding a low severity issue.", "There was a discussion about whether the code trims whitespaces on the Polygon address or the email.", "A question was raised about whether rewards could be paid partially or are always fully paid.", "A user found an email in the spam folder that they had been looking for.", "There was a question about a discrepancy in the number of lines of code (LOC) in the Sherlock contest README and the actual contract files. The Sherlock finance's repo is https://github.com/code-423n4/2022-01-sherlock.", "The LOC discrepancy was clarified as being due to the difference between actual lines and source lines of code (SLOC), with the 179 LOC being the number of actual lines calculated by solidity-coverage.", "A suggestion was made to standardize the way LOCs are counted in future contests to avoid confusion.", "There was a question about whether it is possible to look at all the findings of a contest after it finished but before the results are published.", "A user asked if there is a way to review why a submission to a contest was not rewarded.", "It was clarified that when the report is out, the repo will be fully opened and participants will be able to see the discussion among sponsors and judges on the specific issue.", "A question was raised about whether wardens who report the same vulnerability but with different severities are given the same severity for award calculation.", "It was clarified that the intent behind deduplication is to judge and determine severity after that.", "There was a question about the leaderboard not having the Sublime contest.", "It was mentioned that the Sublime contest leaderboard was being worked on.", "If wardens report the same vulnerability but with different severities, they are given the same severity for award calculation.", "When a submission to a contest is made but not rewarded, it is possible to review why the submission was not accepted once the report is out.", "The order of issue submission does not necessarily determine which issue is considered the original and which are duplicates.", "Judges pick the primary issue based on the quality of the write-up.", "There is a suggestion to incentivize the \"best write-up\" to encourage high quality submissions.", "The primary issue gets to represent the bucket in the published report and the warden gets first attribution.", "Judges can mark an issue to have a higher risk than the proposed risk by wardens if deemed necessary.", "There is some sybil resistance for duplicate submissions of the same vulnerability. Each instance is awarded a share of 1 point depending on the number of duplicates.", "If a participant gets rewards both individually and as a part of a team, their name will appear twice on the leaderboard.", "If no Medium/High vulnerabilities are found, the full pool would then be divided based on the QA Report curve.", "The FEI contest had only low vulnerabilities. The report can be found at https://code4rena.com/reports/2021-11-fei.", "Participants can have their names appear twice in the team.", "If no medium or high vulnerabilities are found in the smart contracts, the full pool would then be divided based on the QA Report curve.", "There have been a few contests with no high vulnerabilities and no contests without a medium vulnerability.", "The FEI contest only had low vulnerabilities, as shown in the report at https://code4rena.com/reports/2021-11-fei.", "The full report of a contest will be graded on a curve against the other reports.", "Non-critical and low severity findings would go into a single report.", "It is possible for a low-impact QA report to be upgraded to a high-impact report.", "Part of auditing is demonstrating proper theory of how an issue could be exploited.", "The DAO constitution prioritizes actions without a vote and has delegated responsibility for running contests.", "A forum post that works through all the moving pieces in the opening constitution and delegation can be found at https://forum.code4rena.com/t/c4ip-1-2-3-4-5-constitution-dao-bootstrapping-reimbursements-token-sale/93.", "The findings repository is typically not made public when the awards are published because the sponsor generally hasn't finished their mitigation work by that time.", "Some of the projects are deployed at the time of the contest.", "The Malt prize pool was changed to account for the increase in judging fee.", "The increase in the judging fee was discussed in the wardens channel due to overwhelming levels of issues on some contests and limited judge availability.", "There was a backlog of issues on some contests due to overwhelming levels and limited judge availability.", "The team had to increase offers for judging compensation for a period of time to clear out the seriously lagging contests in the backlog.", "New contests that are starting will be implementing a new submissions mechanism.", "There were several successful submissions received in the beholder repo during a GitHub outage.", "Beginners interested in learning about different roles in the space can start with resources such as https://cmichel.io/how-to-become-a-smart-contract-auditor/ and https://docs.code4rena.com/roles/wardens/tools-and-resources.", "Constants are cheaper than immutable variables as constants are calculated and filled in at compile time, while immutable variables are read-only state variables.", "Both constants and immutable variables are embedded into the bytecode at deployment, but it costs gas to read state from the contract.", "There are cases where immutable costs less gas than constants, as shown in https://github.com/code-423n4/2021-11-overlay-findings/issues/111.", "As of July 2020, the gas cost for constant and immutable is about equal, as discussed in https://twitter.com/GalloDaSballo/status/1476925462010122245 and https://ethereum.stackexchange.com/questions/118547/is-the-gas-cost-for-constant-and-immutable-about-equal.", "Submissions can be withdrawn by direct messaging a team member.", "A certain finding was true but is no longer the case as of July 2020, as discussed on https://twitter.com/GalloDaSballo/status/1476925462010122245", "Immutable and constant in the context of smart contracts both get inlined at deploy time, as discussed on https://ethereum.stackexchange.com/questions/118547/is-the-gas-cost-for-constant-and-immutable-about-equal", "There is a procedure to withdraw a submission by direct messaging a specific individual.", "There is a question about whether XDEFI has sent their rewards.", "Rewards are allocated on a curve, explained with an analogy of grading homework/exams.", "There is a question about how the rewards would be distributed if there are different quality tiers among the wardens.", "There is a question about what activates a callback in solidity besides Ethereum transfer.", "Callbacks in solidity can be activated by safeTransferFrom onERC721Received, onERC1155Received of ERC1155, tokensReceived tokensToSend of ERC777, and any call to an untrusted external contract. Callbacks are also used in protocols like flashloans, oracles, balancer.", "Judges can potentially increase the severity of a finding from low to medium.", "There is a question about the completion of nftx findings.", "If a contest is listed as 'awarding', it means the rewards are queued at the multisig and should be distributed within a week.", "There is a discussion about whether a situation where a user can lose funds but the admin is involved in the procedure is considered High.", "There is a question about whether there will be an announcement distinguishing the reward for each pool when there are separate pools for different reports.", "There is a question about a size limit on submissions due to errors encountered during submission of a gas report.", "The admin of a smart contract can be incentivized to lock a large amount of tokens in cyberspace to reduce the number of tokens available for trade in the market, which could cause the price to rise.", "The admin of a smart contract is typically a governance framework.", "There are separate pools for different reports and there will be announcements distinguishing the reward for each pool.", "There may be a size limit on submissions, as a user reported an error when trying to submit a gas report.", "For QA & gas reports, users can send one email for each of the two reports to report@code4rena.com.", "Low and non-critical reports (and gas optimizations) for badger citadel should be submitted through the same form.", "Submissions should be in plain text markdown format.", "Emails for submissions may sometimes end up in the spam folder.", "The Cosmos blockchain uses the Rust programming language.", "A link to a Twitter post about smart contracts was shared: https://twitter.com/timurguvenkaya/status/1475843655567089676?s=20", "A link to a course on CosmWasm smart contracts was shared: https://academy.terra.money/courses/cosmwasm-smart-contracts-i", "A link to the GitHub repository for the Anchor Protocol was shared: https://github.com/Anchor-Protocol", "There was an inquiry about getting smart contracts audited for a product being built on the Polygon blockchain.", "The question of whether a minter or burner role is an issue was raised.", "There is a course on CosmWasm smart contracts available at https://academy.terra.money/courses/cosmwasm-smart-contracts-i", "The Anchor Protocol's GitHub repository is available at https://github.com/Anchor-Protocol", "There is a discussion about getting smart contracts audited for a product being built on Polygon.", "There is a question about whether a minter or burner role is an issue.", "There is a discussion about the potential change in risk categories for non-defi protocols.", "There is a discussion about the severity of an attack made by the governance.", "There is a discussion about inconsistencies in judging, with a suggestion to file an issue at https://GitHub.com/code-423n4/rulebook/issues", "There is a link to a specific issue on GitHub at https://github.com/code-423n4/2022-01-livepeer-findings/issues/193", "There is a question about whether the Amun reward has been sent.", "There is a discussion about the tools used to find vulnerabilities and bugs in smart contracts.", "There is a question about how to navigate through multiple .sol files when auditing smart contracts.", "There is a question about finding reports on past competitions, with a link provided to https://code4rena.com/reports", "There is a discussion about learning from past contests and vulnerabilities, with a link provided to the leaderboard at https://code4rena.com/leaderboard/", "There is a discussion about registering an ETH address to receive shares.", "Reports from past contests can be found at https://code4rena.com/reports", "The leaderboard for the contests is available at https://code4rena.com/leaderboard/", "Participants need to register their handle and ETH address to receive their share.", "The submission form for each contest includes a field for the participant's wallet address.", "Code4rena conducts audit contests which are compared to bug bounties. More information can be found at https://docs.code4rena.com/", "There is a fee charged by Code4rena in addition to the bounty paid to wardens.", "The fee amount depends on the specific case and is discussed privately.", "There is a discussion about gas and contract-size optimization award pot, with a suggestion that optimizations must be >= 100 gas saved to be eligible for a reward.", "There is a question about how to treat upgradeable contracts findings in case of Medium-risk vulnerabilities, such as DoSing or bricking the contract.", "Code4rena has set up a Help Desk system to support the community. Requests can be submitted at https://code4rena.com/help", "If a team submits a vulnerability, the payment cannot be split between multiple ETH addresses. The best option is to use a multisig.", "The results of the contests are posted at https://code4rena.com/reports/", "Code4rena has worked with big protocols, but the specifics are not mentioned in the chat.", "Results of the auditing process are posted on https://code4rena.com/reports/", "Once the entire auditing process is complete, a report is published on the aforementioned page.", "Code4Arena has worked with several protocols, which can be viewed at https://code4rena.com/contests", "Code4Arena aims to get more auditors’ eyes on code faster than any other available option and has demonstrated value that has brought established protocols back repeatedly.", "There is no technical limit on the number of members that can be part of a team in Code4Arena.", "The benefits of participating in the contests include learning from others’ findings and leveling up skills.", "There is a question about the transparency of access to certain repositories, as indicated by a 404 error when trying to access https://github.com/code-423n4/code423n4.com/issues/765", "The purpose of ID is not solely to punish exploits applied to deployed code.", "Questions are ideally asked on the forum post itself for context and permanence.", "The estimated time for sending awards after they are announced is within 1-2 weeks.", "If the same vulnerability is reported by multiple wardens, they each get the same share.", "There are pending awards for LPT tokens and NFTX.", "A question was raised about the cost of auditing a platform's code through Code4Arena if no critical or minor vulnerabilities are found.", "LPT tokens and NFTX awards are pending.", "If a platform uses Code4Arena to audit their code and it comes back with no critical or minor vulnerabilities, the cost is not clearly defined and would be handled on a case by case basis.", "The usual process is that the bounty is split amongst those who find bugs.", "If a contest is run and there are zero valid submissions, this is a scenario that has not been encountered so far.", "There have been 100 contests launched by Code4Arena.", "If a user encounters an error when submitting, they can email the submission to submissions@code423n4.com.", "If Gas & QA reports are larger than about ~65k characters, they can't be submitted through the form due to Github's max character limit on the body/description field for issues.", "There are several contests still pending.", "Changes to the award calculation process based on the mechanism change are currently being implemented.", "If a user is having trouble with the support request form, they can send the request to submissions@code4rena.com.", "It is not specified which chains are accepted for payment from the sponsor side.", "Users are attempting to submit information via mobile devices.", "If users encounter issues with submissions, they can send their request to submissions@code4rena.com.", "The platform accepts Eth or Polygon for EVM league contests and Cosmos for Cosmos contests as payment.", "There were issues with the captcha being blocked by some users' browsers.", "There were some issues with GitHub that affected the contest submission form.", "The Rolla contest was extended by 24 hours due to these submission issues. The announcement was made on https://discordapp.com/channels/810916927919620096/953009382021533696/956244354496856174.", "The Biconomy Hyphen 2.0 contest results are being reviewed by the sponsor and will be handed off to a judge for final review. The final report is expected to be published in a couple of weeks.", "Users can view reports on past contests at https://code4rena.com/reports.", "There were questions about how QA and gas reports handle duplicates and formulas, with specific reference to the Redacted Cartel contest.", "The source code for the findings can be found at https://github.com/code-423n4/code423n4.com/blob/main/_data/findings/findings.csv#L9336-L9434.", "There is a concern that the new way of handling reports may not encourage better quality in reports.", "In the Redacted Cartel contest, gas reports G-04, G-05, G-06, G-07, G-08 were rewarded as duplicates, lowering their value for each warden.", "There was a set of nine duplicates in the QA reports: Q-15, Q-13, Q-14, Q-24, Q-11, Q-12, Q-05, Q-10, Q-22.", "This information can be found in the source code: findings.csv at https://github.com/code-423n4/code423n4.com/blob/main/_data/findings/findings.csv#L9336-L9434", "There is a concern that the new way of rewarding may not encourage better quality in reports.", "QA and Gas awards should disregard duplicates, but handling downgraded issues has been tricky.", "QA and Gas reports are awarded on a curve according to judges’ scores.", "There is a difference between static and symbolic security testing. Static testing refers to looking at the code without interacting with it, while symbolic testing is about interacting with the code using software to simulate a transaction.", "Deploying contracts on a testnet is part of symbolic testing.", "All gas findings are supposed to go in one submission.", "There is no rule regarding contest price pool related to lines of code. The contests are scoped, and the 30k ones should be smaller.", "The Sublime contest, which is almost 2000 SLOC, was raised as an example that seems like it should be more than 30k.", "The scope of a project for the purposes of a contest does not include comments and blank lines in the line of code count.", "An update to the documentation was posted to answer some questions about the new awarding model for QA and Gas reports at https://discord.com/channels/810916927919620096/810936719003090974/958455244759650344", "There was an issue with the help form erroring out due to a space in a discord handle.", "The real code to audit for the Sublime contest was not in the C4 repo, leading to some confusion and mistakes.", "There was an issue with the help form erroring out when a space was included in a Discord handle.", "The development team was notified about the issue with the help form.", "Users were advised to include their email address on the help form or include their Discord handle without spaces in the Discord Handle field and let the team know their actual handle in the Description field.", "Some users made a mistake of analyzing and submitting about the master branch instead of checking out the right hash.", "The payment release after the announcement usually takes place on Monday or Tuesday after the signatures on the award distribution multisig are rounded up in a standing Monday meeting.", "Users need to register their handle and ETH address to receive their share.", "When users submit findings, there is a field for their polygon address.", "Only one address is sent for one handle for a contest.", "The original tools for finding submissions and contest processing were simple and have been gradually replaced.", "There has been an effort to move to authenticated warden accounts.", "C4 awards are named by handle and distributed from the same awards address in broad daylight on chain.", "A user asked if a smart contract can create a signature of data so that another smart contract can verify that signature. The response included a link to EIP-1271: https://eips.ethereum.org/EIPS/eip-1271", "If a submission of a finding fails, the form should error. The form accesses GitHub and Mailgun APIs.", "Code4rena has not hosted any Solana contests yet but plans to expand beyond EVM and Cosmos chains.", "Code4rena's homepage did not update contents report after February because the reports and rewards calculation changed.", "A batch of reports is expected to be published soon.", "The reward is not made immediately when the reward compute is done due to the multisig process.", "The intent is to have transactions queue up for signature prior to a standing meeting each Monday.", "Eventually, awards will be distributed via smart contract, but more pieces need to be in place before that can be done.", "A batch of reports is expected to be published soon.", "There is a possibility of hosting Solana contests in the future.", "There are concerns about the timing and tracking of rewards, with some discrepancies in amounts.", "The rewards are currently distributed via multisig, with plans to eventually distribute awards via smart contract.", "There is a suggestion to split 'Awarding:' into 'Awarding:' and 'Paid:' in the announcements.", "There is a question about the JPYC Contest not having any high/medium risk findings, with the response that the codebase is a relatively simple fork of a mature project.", "There is a discussion about the Ronin Bridge hack, with a link to an article about the hack: https://cryptopotato.com/the-biggest-ever-crypto-hack-what-happened-in-the-ronin-bridge-attack/", "There is a link to a technical report about the Ronin Bridge hack: https://rekt.news/ronin-rekt/", "There is a question about the criteria for archiving contests, with the response that it is due to a Discord limit on the number of channels in a single category.", "A suggestion is made to archive contests in quarters (Q1-Q4 2022) or create a second category for 2022 (2022-B) to make it easier to find specific contests.", "This suggestion is implemented, with contests now being archived based on quarters.", "There is a question about releasing all the unverified submissions a few days after a contest ends, with the response that this is in the works: https://forum.code4rena.com/t/rfc-certified-wardens-rulebook-scout-role-contest-qa-and-mitigation-review-services/123", "There is a question about whether high risk findings are still valid if they are out of scope, with the response that it depends on the contest and the judge.", "A user is seeking resources/tips for beginners.", "There is a report of a user being unable to send a text on a specific chat channel."]