{"url": "https://docs.code4rena.com/roles/certified-contributors", "md_content": "[Code4rena](/)\n\nSearch\n\n⌃K\n\n[Code4rena](/)\n\nSearch\n\n⌃K\n\n[Code4rena](/)\n\nRoles\n\n[Wardens](/roles/wardens)\n\n[Sponsors](/roles/sponsors)\n\n[Judges](/roles/judges)\n\n[Certified contributors](/roles/certified-contributors)\n\n[+Backstage wardens](/roles/certified-contributors/backstage-wardens)\n\n[Lookouts](/roles/certified-contributors/lookouts)\n\nAwarding\n\n[Incentive model and awards](/awarding/incentive-model-and-awards)\n\n[Judging criteria](/awarding/judging-criteria)\n\n[Fairness and validity](/awarding/fairness-and-validity)\n\nPhilosophy\n\n[Security is about people](/philosophy/security-is-about-people)\n\n[The culture we're building](/philosophy/how-we-work)\n\n[Intentionally structured](/philosophy/intentionally-structured)\n\nOther Details\n\n[FAQ](/structure/frequently-asked-questions)\n\n[Audit timeline](/structure/our-process)\n\n[Where can I find …?](/structure/where-can-i-find...)\n\n[Powered By\nGitBook](https://www.gitbook.com/?utm_source=content&utm_medium=trademark&utm_campaign=-MYGYvqTD29_fAaod9NJ)\n\n# Certified contributors\n\nIn order to create opportunities for contributions which rely on establishment\nof trust, Code4rena allows community members to opt into certifying their\nidentity and entering into a simple agreement.\n\nContributors who have provided ID verification and a signed agreement may be\neligible to participate in:\n\n  * Private or invite-only contests\n\n  * Scout role (focused on scoping and pre-contest code intel)\n\n  * ​[Judging](/roles/judges)​\n\n  * ​[\"Backstage\" warden opportunities](/roles/certified-contributors/backstage-wardens) (post-contest triage and post-judging QA)\n\n  * Providing mitigation review services\n\n  * Offering solo audit and consulting services through C4\n\nAdditional opportunities we are considering include:\n\n  * Certain contest bonus token awards which may be restricted from US persons due to regulations or token grant agreements\n\n  * May be a factor in maxing out awards in the future\n\n###\n\n **Certification process and constraints**\n\nC4 continues to focus on privacy, so our certification process is done through\na third party ([Provenance](https://provenancecompliance.com/)) that is bound\nby confidentiality. The certification process is as follows:\n\n  1. 1.\n\nAn eligible contributor submits the [Certified Contributor Application\nform](https://code4rena.com/certified-contributor-application/), and agrees to\nthe Certified Contributor Terms and Conditions (see the application form).\n\n  2. 2.\n\nThe DAO's AML/KYC agent, [Provenance](https://provenancecompliance.com/),\ncontacts the contributor to certify their identity.\n\n  3. 3.\n\nProvenance certifies a contributor as having completed their identity\nverification process, and having signed an agreement binding them to code of\nconduct and non-disclosure. Code4 Corporation and the Code4rena DAO do NOT\nhave access to personal information, simply the verified knowledge that the\ncontributor was certified.\n\n  4. 4.\n\nCode4 Corporation contacts the certified contributor to let them know their\napplication has been approved.\n\n####\n\nConstraints\n\n  * In the event that a certified contributor was alleged to have violated the agreement, the Code4rena Cayman Foundation could hire an attorney to pursue remediation.\n\n  * In the event a certified C4 contributor was alleged to be involved in an exploit, Provenance would provide identifying information to authorities.\n\n##\n\nFAQ\n\n####\n\nWhat is the purpose behind having an option for wardens to become certified,\nand why does ID verification factor into that?\n\nAside from bug reports, most security services are not trustless activities,\nand there really isn't a way to make them so without adding immensely\nunworkable complexity (who audits the auditors?) or putting disproportionate\nburden on trusted parties (\"sorry, cmichel and alex, for the sake of C4, you\nhave to verify this anon advice on this bugfix is legit and not elaborate\nsocial engineering\")\n\nThe wider the surface area of interaction with anonymous wardens, the more we\nneed to manage the complexity of both trust and sybil attacks. Keeping\nabsolute anonymity limited to bug reports is where the line can be comfortably\ndrawn.\n\nBut even beyond our own comfort, ultimately a C4 audit is a _productized\nservice_ and sponsors are _customers_. Customers of security products and\nservices generally have higher level of anxiety around trust--and justifiably\neven more so in the dark forest of smart contract security. This approach\nprovides a path for accountability in the extremely unlikely event of\nmalicious behavior, yes, but it also provides a way for us to know that\nwardens have verifiably signed an agreement regarding non-disclosure,\nprofessionalism, and respect for privileged information from sponsors that\nthey presumably intend to honor.\n\nNote that certified wardens are still able to be anon for basically all\nintents and purposes. Unless the shit hit the fan, the C4 DAO wouldn't know\nwho they were, the Foundation wouldn't know who they were, Code4 Corp wouldn't\nknow who they were--just Provenance and attorneys who'd be required to keep\nthat information confidential.\n\n####\n\nWhat would constitute a warden being alleged to have performed an attack?\n\nFirst, let's define \"allegation\": an accusation based on circumstantial\nevidence would not be sufficient, as Provenance (the certifier) would have a\nduty to keep personal information confidential. There would need to be a\nformal, legal allegation wherein Provenance was **subpoenaed** to provide the\ninformation as verification of identity.\n\nSo this is really only relevant in a case where there is sufficient evidence\nthat would stand up in a court of law clearly demonstrating that the specific\nwarden in question was involved in an attack. Provenance would not dox wardens\nat the request of people grasping at straws in a witch hunt.\n\n####\n\nWhat documents are accepted by Provenance in relation to proof of residence?\n\nProvenance will provide exact details after application submission. As of June\n1, 2022, the list of acceptable documents includes:\n\n  * Utility bill clearly stating the service address and mailing address with the individual's name (note: telephone, cellular and credit card bills are not acceptable as these may be mailed to any address)\n\n  * Bank statement\n\n  * Rental or lease agreement\n\n  * Local authority document (e.g. property tax bill, council tax bill etc.)\n\nNote: the document has to be less than 3 months old.\n\n####\n\nHow long does it take to get certified?\n\nOnce you submit the [Certified Contributor Application\nform](https://code4rena.com/certified-contributor-application/), Provenance\ntypically emails you within one business day. (If you don't see an email\nwithin that time frame, we recommend checking your spam folder for email from\n`@provenance.company` or `provenancecompliance.com`.)\n\nProvenance will provide you with detailed instructions. If you have all the\navailable documents, the process can usually be completed within a day.\n\nIt will take longer if you need to assemble the necessary documents.\n\n[PreviousHow to judge an audit](/roles/judges/how-to-judge-a-\ncontest)[Next+Backstage wardens](/roles/certified-contributors/backstage-\nwardens)\n\nLast modified 3d ago\n\nOn this page\n\nCertification process and constraints\n\nFAQ\n\n"}