{"url": "https://docs.code4rena.com/philosophy/how-we-work", "md_content": "[Code4rena](/)\n\nSearch\n\n⌃K\n\n[Code4rena](/)\n\nSearch\n\n⌃K\n\n[Code4rena](/)\n\nRoles\n\n[Wardens](/roles/wardens)\n\n[Sponsors](/roles/sponsors)\n\n[Judges](/roles/judges)\n\n[Certified contributors](/roles/certified-contributors)\n\nAwarding\n\n[Incentive model and awards](/awarding/incentive-model-and-awards)\n\n[Judging criteria](/awarding/judging-criteria)\n\n[Fairness and validity](/awarding/fairness-and-validity)\n\nPhilosophy\n\n[Security is about people](/philosophy/security-is-about-people)\n\n[The culture we're building](/philosophy/how-we-work)\n\n[Intentionally structured](/philosophy/intentionally-structured)\n\nOther Details\n\n[FAQ](/structure/frequently-asked-questions)\n\n[Audit timeline](/structure/our-process)\n\n[Where can I find…?](/structure/where-can-i-find...)\n\n[Powered By\nGitBook](https://www.gitbook.com/?utm_source=content&utm_medium=trademark&utm_campaign=-MYGYvqTD29_fAaod9NJ)\n\n# The culture we're building\n\n###\n\n **Good culture, exceptional talent, and great community don't happen by\naccident --they're thoughtfully cultivated.**\n\nOur goal is to build an organization where:\n\n###\n\nWe feel valued as individuals\n\n  * We feel safe, welcome, and included in the community.\n\n  * We see community members as unique people with our own strengths, weaknesses, wants, and needs\n\n  * We encourage each other and express gratitude for the contributions others make.\n\n###\n\nWe work as a team\n\n  * We trust each other, honor our commitments, and take responsibility.\n\n  * We help each other feel safe bringing forth new ideas, and understand the right places to do that so that others who are interested feel kept in the loop.\n\n  * We look for ways to reduce work by eliminating and simplifying tasks and recognizing that sometimes _fewer_ ideas are better to achieve an outcome.\n\n  * We know when, where, and how we can best contribute based on the current needs and direction of the organization.\n\n###\n\nWe make decisions together\n\n  * We focus on reaching outcomes __ together.\n\n  * Everyone contributes to building the direction of the organization in an emergent way.\n\n  * We can see and understand how decisions get made.\n\n  * We know where to go to find out more information or get involved in an area.\n\n  * We work to create and use systems that help us avoid both information overwhelm and the sense that we need to follow everything that's happening in order to not miss out contributing our thoughts to something we care about.\n\n###\n\nWe learn and grow\n\n  * We stretch our capabilities, grow our talents, and help others do the same.\n\n  * We are constantly finding ways to learn and improve as an organization.\n\n  * We leave breadcrumbs along the way for those who follow after us in the learning we have done.\n\n  * We look for opportunities to invest in the learning and growth of others.\n\n###\n\nWe do impactful work\n\n  * The work we do positively impacts our industry, our community, and the individual people who our organization interacts with.\n\n  * The approaches we develop and the work we do benefits other communities.\n\n  * The learning we share and the opportunities we provide creates new possibilities in the lives of others.\n\n[Philosophy - PreviousSecurity is about people](/philosophy/security-is-about-\npeople)[Next \\- PhilosophyIntentionally structured](/philosophy/intentionally-\nstructured)\n\nLast modified 1yr ago\n\nOn this page\n\nGood culture, exceptional talent, and great community don't happen by accident\n--they're thoughtfully cultivated.\n\nWe feel valued as individuals\n\nWe work as a team\n\nWe make decisions together\n\nWe learn and grow\n\nWe do impactful work\n\n"}