{"url": "https://docs.code4rena.com/awarding/incentive-model-and-awards", "md_content": "[Code4rena](/)\n\nSearch\n\n⌃K\n\n[Code4rena](/)\n\nSearch\n\n⌃K\n\n[Code4rena](/)\n\nRoles\n\n[Wardens](/roles/wardens)\n\n[Sponsors](/roles/sponsors)\n\n[Judges](/roles/judges)\n\n[Certified contributors](/roles/certified-contributors)\n\nAwarding\n\n[Incentive model and awards](/awarding/incentive-model-and-awards)\n\n[Awarding process](/awarding/incentive-model-and-awards/awarding-process)\n\n[Curve logic for QA and Gas optimization reports](/awarding/incentive-model-\nand-awards/curve-logic)\n\n[FAQ about QA and Gas Reports](/awarding/incentive-model-and-awards/qa-gas-\nreport-faq)\n\n[Judging criteria](/awarding/judging-criteria)\n\n[Fairness and validity](/awarding/fairness-and-validity)\n\nPhilosophy\n\n[Security is about people](/philosophy/security-is-about-people)\n\n[The culture we're building](/philosophy/how-we-work)\n\n[Intentionally structured](/philosophy/intentionally-structured)\n\nOther Details\n\n[FAQ](/structure/frequently-asked-questions)\n\n[Audit timeline](/structure/our-process)\n\n[Where can I find…?](/structure/where-can-i-find...)\n\n[Powered By\nGitBook](https://www.gitbook.com/?utm_source=content&utm_medium=trademark&utm_campaign=-MYGYvqTD29_fAaod9NJ)\n\n# Incentive model and awards\n\nTo incentivize **wardens** , C4 uses a unique scoring system with two primary\ngoals: reward contestants for finding unique bugs and also to make the audit\nresistant to Sybil attack. A secondary goal of the scoring system is to\nencourage contestants to form teams and collaborate.\n\n **Judges** are incentivized to review findings and decide their severity,\nvalidity, and quality by receiving a share of the prize pool themselves.\n\n##\n\nHigh and Medium Risk bugs\n\nContestants are given shares for bugs discovered based on severity, and those\nshares give the owner a pro rata piece of the pot:\n\n`Med Risk Shares: 3 * (0.9 ^ (findingCount - 1)) / findingCount` `High Risk\nShares: 10 * (0.9 ^ (findingCount - 1)) / findingCount`\n\nFindingCount represents the number of findings for a same specific bug. Please\nnote that findings with partial credit as still count as 1 finding in the\nalgorithm\n\nDuring awarding, each share is redeemed for: `pot / number of shares`.\n\n###\n\nBonus for best / selected for report\n\nFor each unique High or Medium finding, the submission selected for inclusion\nin the audit report receives a 30% share bonus.\n\n###\n\nDuplicates getting partial credit\n\nAll issues which identify the same functional vulnerability will be considered\nduplicates regardless of effective rationalization of severity or exploit\npath.\n\nHowever, any submissions which do not identify or effectively rationalize the\ntop identified severity case may be judged as \"partial credit\" and may have\ntheir shares in that finding's pie divided by 2 or 4 at judge's sole\ndiscretion (e.g. 50% or 25% of the shares of a satisfactory submission in the\nduplicate set).\n\n##\n\nBot races\n\nThe first hour of each Code4rena audit is devoted to a bot race, to\nincentivize high quality automated findings as the first wave of the audit.\n\n  * The winning bot report is selected and shared with all wardens within 24 hours of the audit start time.\n\n  * The full set of issues identified by the best automated tools are considered out of scope for the audit and ineligible for awards.\n\nDoing this eliminates the enormous overlapping effort of all wardens needing\nto document common low-hanging issues And because the best bot report is\nshared with auditors at the start of the audit, these findings serve as a\nthorough starting place for understanding the codebase and where weaknesses\nmay exist.\n\n **Ultimately, the bot race ensures human auditors are focused on things\nhumans can do.**\n\nBy designating a portion of the pool in this direction, Code4rena creates a\nseparate lane for the significant investment of effort that many auditors\nalready make in automated tooling -- and rather than awarding 100 people for\nidentifying the same issue, we award the best automated tools.\n\n##\n\nAnalyses\n\nEach warden is encouraged to submit an Analysis alongside their findings for\neach audit, to share high-level advice and insights from their review of the\ncode.\n\nWhere individual findings are the \"trees\" in an audit, the Analysis is a\n\"forest\"-level view.\n\nAdvanced-level Analyses compete for a portion of each audit's award pool, and\nare graded and awarded similarly to QA and Gas Optimization reports.\n\n##\n\nQA and Gas Optimization Reports\n\nIn order to incentivize wardens to focus efforts on high and medium severity\nfindings while also ensuring quality coverage, the pool's allocation is capped\nfor low severity, non-critical, and gas optimization findings.\n\nLow and non-critical findings are submitted as a **single** QA report.\nSimilarly, gas optimizations are submitted as a single gas report. For more on\nreports, see [Judging criteria](/awarding/judging-criteria).\n\nQA and gas optimization reports are awarded on a curve based on the judge's\nscore.\n\n  * QA reports compete for a share of 2.5% of the prize pool (e.g. $1,250 for a $50,000 audit);\n\n  * The gas optimization pool varies from audit to audit, but is typically 2.5% of the total prize pool (e.g. $1,250 for a $50,000 audit);\n\n  * QA and Gas optimization reports are scored by judges using A/B/C grades (with C = unsatisfactory), and awarded on a curve.\n\nThere is a very high burden of quality and value provided for QA and gas\noptimization reports. Only submissions that demonstrate full effort worthy of\nconsideration for inclusion in the report will be eligible for rewards.\n\nIt is highly recommended to clearly spell out the impact of proposed gas\noptimizations.\n\nHistorically, Code4rena valued non-critical findings at 0; the intent of the\nQA report is not to increase the value of non-criticals, but rather to allow\nthem to be consolidated in reports alongside low severity issues.\n\n **Note:** Audits pre-dating February 3, 2022 awarded low risk and gas\noptimization shares as: `Low Risk Shares: 1 * (0.9 ^ (findingCount - 1)) /\nfindingCount`\n\n##\n\nGrades for Analyses, QA and Gas reports\n\nAnalyses, QA reports and Gas reports are graded A, B, or C.\n\nC scores are unsatisfactory and ineligible for awards.\n\nAll A-grade reports receive a score of 2; All B-grade reports get a 1.\nAwarding for QA and Gas reports is on a curve that's described\n[here](https://docs.code4rena.com/awarding/incentive-model-and-awards/curve-\nlogic).\n\n###\n\nBonus for best / selected for report\n\nJudges choose the best report in each category (Analysis, QA report, and Gas\nreport), each of which earns the same 30% share bonus described under \"High\nand Medium Risk bugs.\"\n\n **Note:** if the `selected for report` submission has a B-grade label, it\nwill still be treated as A-grade and given proportionally more than B-grade,\nplus the 30% bonus for being `selected for report`.\n\n##\n\nSatisfactory / unsatisfactory submissions\n\nAny submissions deemed unsatisfactory are ineligible for awards.\n\nThe bar for satisfactory submissions is that they are roughly at a level that\ncould be found in a draft report by a professional auditor: specifically on\nthe merits of technical substance, with writing quality considered only where\nit interferes with comprehension of the technical message.\n\nIt is possible for a submission to be _technically_ valid and still\nunsatisfactory. An \"unsatisfactory\" submission may meet any of these criteria:\n\n  * incorrect\n\n  * low/incomplete effort\n\n  * out of scope\n\n  * clearly overinflated severity\n\n  * proof of concept does not pass the burden of proof test\n\n  * approach is disrespectful of sponsors' and judges' time in some way\n\nAny submissions that appear to be direct copies of other reports in the\ncurrent audit will be collectively deemed unsatisfactory.\n\n[PreviousLookouts](/roles/certified-contributors/lookouts)[NextAwarding\nprocess](/awarding/incentive-model-and-awards/awarding-process)\n\nLast modified 10d ago\n\nOn this page\n\nHigh and Medium Risk bugs\n\nBonus for best / selected for report\n\nDuplicates getting partial credit\n\nBot races\n\nAnalyses\n\nQA and Gas Optimization Reports\n\nGrades for Analyses, QA and Gas reports\n\nBonus for best / selected for report\n\nSatisfactory / unsatisfactory submissions\n\n"}