{"url": "https://docs.code4rena.com/philosophy/intentionally-structured", "md_content": "[Code4rena](/)\n\nSearch\n\n⌃K\n\n[Code4rena](/)\n\nSearch\n\n⌃K\n\n[Code4rena](/)\n\nRoles\n\n[Wardens](/roles/wardens)\n\n[Sponsors](/roles/sponsors)\n\n[Judges](/roles/judges)\n\n[Certified contributors](/roles/certified-contributors)\n\nAwarding\n\n[Incentive model and awards](/awarding/incentive-model-and-awards)\n\n[Judging criteria](/awarding/judging-criteria)\n\n[Fairness and validity](/awarding/fairness-and-validity)\n\nPhilosophy\n\n[Security is about people](/philosophy/security-is-about-people)\n\n[The culture we're building](/philosophy/how-we-work)\n\n[Intentionally structured](/philosophy/intentionally-structured)\n\nOther Details\n\n[FAQ](/structure/frequently-asked-questions)\n\n[Audit timeline](/structure/our-process)\n\n[Where can I find…?](/structure/where-can-i-find...)\n\n[Powered By\nGitBook](https://www.gitbook.com/?utm_source=content&utm_medium=trademark&utm_campaign=-MYGYvqTD29_fAaod9NJ)\n\n# Intentionally structured\n\n###\n\nWe are an intentionally structured open organization\n\nWe believe that a challenge as big as making DeFi more secure requires an\noutstanding community.\n\nBy creating clear, understandable structure to our organization, we empower\nmore people to feel welcome to get involved and play their part in building\nthe best community-driven organization we can.\n\n###\n\nWhy structure matters\n\nOpen organizations are not 'flat', as much as we might say they are, or even\nthough we might like them to be.\n\nAs [explored in detail by Jo\nFreeman](https://www.jofreeman.com/joreen/tyranny.htm), the absence of a\ndefined structure leads organizations to end up with hidden hierarchy and\nunwritten rules of 'how things really get done', which can be ultimately\ndisempowering and not very conducive to organizational clarity and\neffectiveness.\n\nIf everyone has a seat at the table, decisions end up being made at a table\nnot everyone can see. That's not malicious or deceitful, it's human nature and\nit's actually wise. Because of our innate understanding that new ideas need\nprotection and candid feedback is best given with a thoughtful approach,\npeople seek environments they trust where they can share ideas vulnerably and\nseek candid feedback without the need to feel defensive, fear they'll look\nstupid, or risk conflict.\n\nIn the absence of formal channels and approaches for this in any organization,\npeople will use informal channels, so failing to account for this reality\nactually exacerbates the tendency for open organizations to have hidden\nhierarchy.\n\nBased on this, it is our intent to spell out very clearly how things work and\nincreasingly work to hold ourselves accountable to work within our process.\n\n###\n\nLow stress, on schedule\n\nUnlike many other DAOs, C4 offers a service on a fixed\n[timeline](/structure/our-process), so we need an approach that helps us\nreliably execute on schedule.\n\nAs the organization evolves, we will take more and more of an 'open swarm'\napproach to our urgent tasks, but in the near-term we rely on a group of paid\nstaff who keep things moving forward every day so the rest of the community\ncan contribute where and how they see best.\n\nThe goal of this phase is to so thoroughly and completely document and\nsystematize our processes that we are able to consistently execute an\nincreasingly complex process with reliability and low stress.\n\n###\n\nTools and processes to shape the river\n\nInformation and decisions flow at different speeds, with each requiring\ndifferent context, granularity, and presentation.\n\nThe tools we use and the ways we use them tend to set the pace and flow of the\nriver of activity. While people often want to have one tool to rule them all,\na mixture of tools is essential for capturing information, reducing cognitive\nload and creating emotional safety while blending urgent vs. emergent, 1ft vs.\n30,000ft, process vs. strategy, task vs possibility.\n\n###\n\n​\n\n[Philosophy - PreviousThe culture we're building](/philosophy/how-we-\nwork)[Next \\- Other DetailsFAQ](/structure/frequently-asked-questions)\n\nLast modified 1yr ago\n\nOn this page\n\nWe are an intentionally structured open organization\n\nWhy structure matters\n\nLow stress, on schedule\n\nTools and processes to shape the river\n\n"}