{"url": "https://docs.code4rena.com/roles/judges", "md_content": "[Code4rena](/)\n\nSearch\n\n⌃K\n\n[Code4rena](/)\n\nSearch\n\n⌃K\n\n[Code4rena](/)\n\nRoles\n\n[Wardens](/roles/wardens)\n\n[Sponsors](/roles/sponsors)\n\n[Judges](/roles/judges)\n\n[How to judge an audit](/roles/judges/how-to-judge-a-contest)\n\n[Certified contributors](/roles/certified-contributors)\n\nAwarding\n\n[Incentive model and awards](/awarding/incentive-model-and-awards)\n\n[Judging criteria](/awarding/judging-criteria)\n\n[Fairness and validity](/awarding/fairness-and-validity)\n\nPhilosophy\n\n[Security is about people](/philosophy/security-is-about-people)\n\n[The culture we're building](/philosophy/how-we-work)\n\n[Intentionally structured](/philosophy/intentionally-structured)\n\nOther Details\n\n[FAQ](/structure/frequently-asked-questions)\n\n[Audit timeline](/structure/our-process)\n\n[Where can I find…?](/structure/where-can-i-find...)\n\n[Powered By\nGitBook](https://www.gitbook.com/?utm_source=content&utm_medium=trademark&utm_campaign=-MYGYvqTD29_fAaod9NJ)\n\n# Judges\n\nJudges decide the severity, validity, and quality of findings and rate the\nperformance of wardens.\n\nJudging is a central part of the C4 competitive audit model.\n\nIn order to align wardens with sponsors, and remove the burden from each\nplayer in the arena from determining the ultimate severity of findings, C4\nselects an impartial judge for each audit.\n\nJudges review warden findings and sponsor input, and come to their own\nindependent conclusion. Doing this enables C4 to determine awards for wardens\nand categorize findings for audit reports.\n\nIn order to ensure the impartiality of the process, the C4 community gives\njudges final authority to determine the severity of findings. Judges receive\ncompensation for their work based on a percentage of the audit pool.\n\n##\n\nBecoming a judge\n\nJudging is an important and elite Code4rena role. It also provides a\nguaranteed payout from each audit.\n\nIn order to ensure accountability for impartiality, the C4 community taps\njudges who are typically established, visible members of the DeFi community\nwhich come based on endorsements from someone who has judged at least two\naudits.\n\nWe also have a process for vetting judge applications from within the C4\ncommunity.\n\n###\n\nCommunity judges\n\nCommunity judges are those who emerge self-selected from the C4 community. We\nare thrilled to have folks interested in playing this role.\n\nIn order to ensure the impartiality and depth of knowledge we aim for among\njudges, we have some additional diligence required for self-selecting judges.\n\n####\n\nMinimum criteria (subject to change)\n\n  * Compete in at least 3 Code4rena audits\n\n  * Find at least 3 high severity bugs\n\n  * Must be a [Certified C4 contributor](/roles/certified-contributors) in good standing\n\n####\n\nNon-technical criteria\n\n  *  **Sense of fairness** --i.e. evidence suggests you don't show favoritism, but instead aim for a fair competition where quality is rewarded.\n\n  *  **Discernment** --ability to impartially a) assess the logic behind a vulnerability, b) verify its validity, and c) determine its severity, given the specifics outlined by the warden as well as the broader context of the code.\n\n  *  **Clear written communication** --your English does not need to be perfect, but you should be able to engage in nuanced discussions with wardens and sponsors via written text.\n\n###\n\nHow to apply\n\nComplete [this form](https://code4rena.com/judge-application/) and share:\n\n  * Short bio/intro and summary of relevant experience\n\n  * Links that help demonstrate your expertise\n\n  * 3 example submissions to Code4rena audits that were judged high severity\n\n  * Description of how each submission demonstrates your depth of knowledge\n\n **Note:** judge applications are reviewed during a one-week period each\nmonth. Notices of application and review windows will be posted in the C4\nDiscord server.\n\n###\n\nJudge selection process\n\nBeing a judge is a critical role and we only have so many spots.\n\nJudge applications are reviewed monthly by the C4 judge selection committee,\nwhich includes top leaderboard wardens and past judges. The committee will\nreview your application and give you a \"yes\" or \"not yet\".\n\n###\n\nIs it possible for a warden who competed in an audit to judge that same audit?\n\nYes--but in the interest of impartiality, they must forgo any awards they\nwould have received for their findings in said audit.\n\n[PreviousAudit process](/roles/sponsors/contest-process)[NextHow to judge an\naudit](/roles/judges/how-to-judge-a-contest)\n\nLast modified 2mo ago\n\nOn this page\n\nBecoming a judge\n\nCommunity judges\n\nHow to apply\n\nJudge selection process\n\nIs it possible for a warden who competed in an audit to judge that same audit?\n\n"}