{"url": "https://docs.code4rena.com/roles/sponsors", "md_content": "[Code4rena](/)\n\nSearch\n\n⌃K\n\n[Code4rena](/)\n\nSearch\n\n⌃K\n\n[Code4rena](/)\n\nRoles\n\n[Wardens](/roles/wardens)\n\n[Sponsors](/roles/sponsors)\n\n[Audit process](/roles/sponsors/contest-process)\n\n[Judges](/roles/judges)\n\n[Certified contributors](/roles/certified-contributors)\n\nAwarding\n\n[Incentive model and awards](/awarding/incentive-model-and-awards)\n\n[Judging criteria](/awarding/judging-criteria)\n\n[Fairness and validity](/awarding/fairness-and-validity)\n\nPhilosophy\n\n[Security is about people](/philosophy/security-is-about-people)\n\n[The culture we're building](/philosophy/how-we-work)\n\n[Intentionally structured](/philosophy/intentionally-structured)\n\nOther Details\n\n[FAQ](/structure/frequently-asked-questions)\n\n[Audit timeline](/structure/our-process)\n\n[Where can I find…?](/structure/where-can-i-find...)\n\n[Powered By\nGitBook](https://www.gitbook.com/?utm_source=content&utm_medium=trademark&utm_campaign=-MYGYvqTD29_fAaod9NJ)\n\n# Sponsors\n\nSponsors purchase a competitive audit, which includes an award pot to\nincentivize wardens to audit their project.\n\n##\n\nSponsoring an audit\n\nAny project can submit a request to sponsor a C4 audit. Just [complete this\nform](https://code4rena.typeform.com/i-want-an-audit) and we will reach out to\nset up a meeting or send over a scoping questionnaire to get the ball rolling.\n\nOne of our team members will review your repo, assess your responses and\ncontracts, and recommend which audit package would be appropriate for your\nscope.\n\n **If you decide to move ahead with an audit, all relevant code will be made\npublic at the time of your audit in most cases.** We also offer KYC and\nprivate competitions if privacy is a need; just let our team know.\n\n###\n\nScoping\n\nOur scoping form asks for several technical details to help our team assess\nthe scope of your audit. There are several scoping considerations beyond a\nsimple sLOC count. Here are two we're often asked about:\n\n  1. 1.\n\n **Lines of Code count:** Please [run the `prettier`\nplugin](https://github.com/prettier-solidity/prettier-plugin-solidity)\nconfigured to a 100-character line length before counting LOCs. (You don't\nneed to commit these changes to your repo; it's just for getting a\nstandardized LOC count.)\n\n  2. 2.\n\n **Test coverage %:** If you have less than 80% test coverage on your\ncontracts, we strongly advise booking a [Test Coverage\ncompetition](https://code4rena.com/test-coverage) immediately prior to your\nCode4rena audit. Doing this can drastically improve the quality of your audit\nby reducing the number of invalid submissions, incentivizing top-performing\nwardens, and typically saves you time overall by speeding up the judging and\nreview phase of your audit.\n\nThere are other benefits, too, [all outlined\nhere](https://medium.com/code4rena/new-to-code4rena-test-\ncoverage-c548645404f9).\n\n####\n\nRunning `prettier` to provide a standardized LOC count\n\nThe default command to run `prettier` is `prettier --write contracts/**/*.sol`\nor `npx prettier -w $(find contracts src -name \"*.sol\" | grep -v \\.t\\.sol)`\n\nWe use a 100-character line length standard for scoping, and our default\n`.prettierrc` is:\n\n{\n\n\"overrides\": [\n\n{\n\n\"files\": \"*.sol\",\n\n\"options\": {\n\n\"printWidth\": 100,\n\n\"tabWidth\": 4,\n\n\"useTabs\": false,\n\n\"singleQuote\": false,\n\n\"bracketSpacing\": false,\n\n}\n\n}\n\n]\n\n}\n\n###\n\nDetermining pot size\n\nTo attract warden participation in the highly competitive engineering market,\nwe work with standard award pool sizes based on the scope of the audit. We\nregularly evaluate and adjust audit pricing to ensure incentive alignment with\nwardens. Sponsors always have the option of boosting their award pool, which\ntends to attract more warden talent and attention.\n\n###\n\nAnalysis pool\n\n5% of each audit's award pool is typically allocated to Analyses. These\nreports contain high-level advice and review of the code: the \"forest\" to\nindividual findings' \"trees.\" They augment and contextualize the bug reports\nthat are incentivized by the remaining 95% of the pool.\n\nFor a long time, wardens have wanted a better place to contribute value via\nthe high-level / overview / advice that isn't necessarily covered by specific\nbugs. The Analysis pool provides them with a method to get credit for this\nadvisory-level work.\n\nProjects have discretion to adjust the default allocation for the Analysis\npool up or down; this should be clarified during the pre-audit booking and\nsetup phase.\n\n###\n\nGas optimization pool\n\nBy default, 2.5% of the award pool is allocated to valid gas optimizations. We\nencourage all sponsors to keep this in place, as we can help each other be\nconscious of ways to minimize gas fees for users -- and indeed some sponsors\nmay which to allocate a higher percentage of the award pool to this purpose.\n\nSome projects may not wish to create a separate incentive for gas\noptimizations, and removing it should be discussed with Code4rena staff during\nthe pre-audit setup phase.\n\n###\n\nOrg fee\n\nThere is a fee on top of the determined audit pool, which goes to the\nCode4rena DAO to cover the costs associated with organizing, promoting, and\nreporting on audits.\n\n###\n\nAudit scheduling\n\nOur standard, one-week audits start and end on weekdays at 20:00:00 UTC. Due\nto high demand, we only lock audits into the schedule after receiving a\ndeposit for the audit; we are unable to make scheduling commitments otherwise.\n\nNote that in order to provide your team with the most efficient and effective\ncode review, we require your team to add ALL code, documentation, and notes to\nyour audit repo at least 2 business days prior to your audit start time.\n\n[PreviousTools and resources](/roles/wardens/tools-and-resources)[NextAudit\nprocess](/roles/sponsors/contest-process)\n\nLast modified 3d ago\n\nOn this page\n\nSponsoring an audit\n\nScoping\n\nDetermining pot size\n\nAnalysis pool\n\nGas optimization pool\n\nOrg fee\n\nAudit scheduling\n\n"}